scripts/paper2/gridOpti/CaseOrigSemi2/constant/UNeTable.csv_
((0 -1.4)
(1 -2)
(2 -2.5)
(3 -3)
(20 -1.65)
(21 -1.85)
(30 -1.85)
(31 -2.05)
(40 -2.05)
(41 -2.25)
(50 -2.25)
(51 -2.45)
(60 -2.45)
(61 -2.65)
(70 -2.65)
(71 -2.85)
(80 -2.85)
(81 -3.05)
(90 -3.05)
(91 -3.25)
(100 -3.25)
(101 -3.45)
(110 -3.45)
(111 -3.65)
(120 -3.65)
(121 -3.85)
(130 -3.85)
(131 -4)
(140 -4))

