scripts/paper2/gridOpti/CaseOrigSemi2/0.orig/J
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      J;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 0 1 0];

internalField   uniform 0;

boundaryField
{
    PNe
    {
	type		zeroGradient;
    }
    PPe
    {
	type		zeroGradient;
    }
    frontAndBack
    {
	type		empty;
    }
    Inlet1
    {
    	type		zeroGradient;
    }
    Inlet2
    {
    	type		zeroGradient;
    }
    Outlet1
    {
        type            zeroGradient;
    }
    Outlet2
    {
        type            zeroGradient;
    }
        OWall
    {
	type 		zeroGradient;
        
    }
    Walls
    {
	type 		zeroGradient;
    }
    
}


// ************************************************************************* //
